scratch/tmp/pytest-of-Micha/pytest-1/test_thin_body_refinement_is_l0/case/system/controlDict
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}
application simpleFoam;
startFrom startTime; startTime 0; stopAt endTime; endTime 1000; deltaT 1;
writeControl timeStep; writeInterval 100; purgeWrite 0;
writeFormat binary; writePrecision 10; writeCompression off; timeFormat general; timePrecision 10;
runTimeModifiable false;
functions { loads { type forces; libs ("libforces.so"); patches (primitive_0 primitive_1 primitive_2 primitive_3 primitive_4 primitive_5); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_primitive_0 { type forces; libs ("libforces.so"); patches (primitive_0); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_primitive_1 { type forces; libs ("libforces.so"); patches (primitive_1); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_primitive_2 { type forces; libs ("libforces.so"); patches (primitive_2); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_primitive_3 { type forces; libs ("libforces.so"); patches (primitive_3); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_primitive_4 { type forces; libs ("libforces.so"); patches (primitive_4); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
load_primitive_5 { type forces; libs ("libforces.so"); patches (primitive_5); rho rhoInf; rhoInf 1.204; pRef 0; CofR (0 0 0); log true; writeControl timeStep; writeInterval 1; }
residuals { type solverInfo; libs ("libutilityFunctionObjects.so"); fields (p U); writeControl timeStep; writeInterval 1; }
yPlus { type yPlus; libs ("libfieldFunctionObjects.so"); writeControl writeTime; }
flux_inlet { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name inlet; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_inlet { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name inlet; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; }
flux_outlet { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name outlet; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_outlet { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name outlet; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; }
flux_front { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name front; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_front { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name front; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; }
flux_back { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name back; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_back { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name back; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; }
flux_ground { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name ground; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_ground { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name ground; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; }
flux_top { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name top; operation sum; fields (phi); writeFields false; writeControl timeStep; writeInterval 1; }
pressure_top { type surfaceFieldValue; libs ("libfieldFunctionObjects.so"); regionType patch; name top; operation areaAverage; fields (p); writeFields false; writeControl timeStep; writeInterval 1; } }
