scratch/tmp/pytest-of-Micha/pytest-1/test_thin_body_refinement_is_l0/case/constant/turbulenceProperties
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object turbulenceProperties;
}
simulationType RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }
