scratch/tmp/pytest-of-Micha/pytest-1/test_thin_body_refinement_is_l0/case/0/U
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 object U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (20 0 0);
boundaryField
{
inlet { type fixedValue; value uniform (20 0 0); }
outlet { type pressureInletOutletVelocity; value uniform (0 0 0); }
front { type freestream; freestreamValue uniform (20 0 0); value uniform (20 0 0); }
back { type freestream; freestreamValue uniform (20 0 0); value uniform (20 0 0); }
ground { type freestream; freestreamValue uniform (20 0 0); value uniform (20 0 0); }
top { type freestream; freestreamValue uniform (20 0 0); value uniform (20 0 0); }
primitive_0 { type fixedValue; value uniform (0 0 0); }
primitive_1 { type fixedValue; value uniform (0 0 0); }
primitive_2 { type fixedValue; value uniform (0 0 0); }
primitive_3 { type fixedValue; value uniform (0 0 0); }
primitive_4 { type fixedValue; value uniform (0 0 0); }
primitive_5 { type fixedValue; value uniform (0 0 0); }
}
