scratch/tmp/pytest-of-Micha/pytest-1/test_thin_body_refinement_is_l0/case/0/k
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.06000000000000001;
boundaryField
{
inlet { type fixedValue; value uniform 0.06000000000000001; }
outlet { type inletOutlet; inletValue uniform 0.06000000000000001; value uniform 0.06000000000000001; }
front { type inletOutlet; inletValue uniform 0.06000000000000001; value uniform 0.06000000000000001; }
back { type inletOutlet; inletValue uniform 0.06000000000000001; value uniform 0.06000000000000001; }
ground { type inletOutlet; inletValue uniform 0.06000000000000001; value uniform 0.06000000000000001; }
top { type inletOutlet; inletValue uniform 0.06000000000000001; value uniform 0.06000000000000001; }
primitive_0 { type kqRWallFunction; value uniform 0.06000000000000001; }
primitive_1 { type kqRWallFunction; value uniform 0.06000000000000001; }
primitive_2 { type kqRWallFunction; value uniform 0.06000000000000001; }
primitive_3 { type kqRWallFunction; value uniform 0.06000000000000001; }
primitive_4 { type kqRWallFunction; value uniform 0.06000000000000001; }
primitive_5 { type kqRWallFunction; value uniform 0.06000000000000001; }
}
