scratch/tmp/pytest-of-Micha/pytest-1/test_thin_body_refinement_is_l0/case/0/nut
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
inlet { type calculated; value uniform 0; }
outlet { type calculated; value uniform 0; }
front { type calculated; value uniform 0; }
back { type calculated; value uniform 0; }
ground { type calculated; value uniform 0; }
top { type calculated; value uniform 0; }
primitive_0 { type nutkWallFunction; value uniform 0; }
primitive_1 { type nutkWallFunction; value uniform 0; }
primitive_2 { type nutkWallFunction; value uniform 0; }
primitive_3 { type nutkWallFunction; value uniform 0; }
primitive_4 { type nutkWallFunction; value uniform 0; }
primitive_5 { type nutkWallFunction; value uniform 0; }
}
