scratch/tmp/pytest-of-Micha/pytest-1/test_thin_body_refinement_is_l0/case/system/decomposeParDict
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object decomposeParDict;
}
numberOfSubdomains 4;
method scotch;
